Repository: filipbartek/argparse-cs
Catalog: argparse-*.po
Languages: cs

source: usage:
cs: použití:

source: .__call__() not defined
cs: .__call__() není definována

source: unknown parser %(parser_name)r (choices: %(choices)s)
cs: neznámý parser %(parser_name)r (možnosti: %(choices)s)

source: argument "-" with mode %r
cs: argument "-" s módem %r

source: can't open '%s': %s
cs: nelze otevřít '%s': %s

source: cannot merge actions - two groups are named %r
cs: nelze smíchat akce - dvě skupiny se jmenují %r

source: 'required' is an invalid argument for positionals
cs: argument 'required' je neplatný pro poziční argumenty

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
cs: neplatná volba %(option)r: musí začínat znakem %(prefix_chars)r

source: dest= is required for options like %r
cs: dest= je vyžadován pro volby jako %r

source: invalid conflict_resolution value: %r
cs: neplatná hodnota conflict_resolution: %r

source: mutually exclusive arguments must be optional
cs: vzájemně výlučené argumenty musí být volitelné

source: positional arguments
cs: poziční argumenty

source: optional arguments
cs: volitelné argumenty

source: show this help message and exit
cs: zobraz tuto nápovědu a ukonči program

source: cannot have multiple subparser arguments
cs: nelze mít více subparserů

source: unrecognized arguments: %s
cs: neznámé argumenty: %s

source: not allowed with argument %s
cs: není povoleno s argumentem %s

source: ignored explicit argument %r
cs: ignorován explicitní argument %r

source: the following arguments are required: %s
cs: následující argumenty jsou vyžadovány: %s

source: one of the arguments %s is required
cs: jeden z argumentů %s je vyžadován

source: expected one argument
cs: očekáván jeden argument

source: expected at most one argument
cs: očekáván nejvýše jeden argument

source: expected at least one argument
cs: očekáván nejméně jeden argument

source: ambiguous option: %(option)s could match %(matches)s
cs: nejednoznačná volba: %(option)s může odpovídat %(matches)s

source: unexpected option string: %s
cs: nečekaná volba: %s

source: %r is not callable
cs: %r není volatelný

source: invalid %(type)s value: %(value)r
cs: neplatná hodnota typu %(type)s: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
cs: neplatná volba: %(value)r (zvolte z %(choices)s)

source: %(prog)s: error: %(message)s
cs: %(prog)s: chyba: %(message)s
